/* Translation.strings\n    SAPTracker\n  \n    Created by Raimund Wege on 27.07.16.\n    Copyright © 2016 com.sap.sailing. All rights reserved.\n  \n\n   MARK: - Common */
"Common.Cancel" = "Zrušit";

"Common.OK" = "OK";

"Common.Info" = "Informace";

"Common.Warning" = "Upozornění";

"Common.Error" = "Chyba";

"Common.Yes" = "Ano";

"Common.No" = "Ne";

"Common.Settings" = "Nastavení";

"Common.Logout" = "Odhlásit";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "Vítejte %@";

"RegattaCheckInController.WelcomeAlert.Message" = "Přihlašujete se jako %@.";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "To nejsem já!";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "Režim";

"GPSFixController.Mode.Error" = "Chyba API";

"GPSFixController.Mode.BatterySaving" = "Úspora baterie";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "Online";

"GPSFixController.Mode.Offline" = "Offline";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "GPS je pro tuto aplikaci vypnuté, ale pro sledování jsou polohy podle GPS nezbytné. Chcete v nastavení polohy GPS zapnout?";

"LocationManager.LocationServicesDisabledError" = "GPS je vypnuté, ale pro sledování jsou polohy podle GPS nezbytné. Chcete v nastavení polohy GPS zapnout?";

"LocationManager.Status" = "Status";

"LocationManager.Status.Tracking" = "Sledování";

"LocationManager.Status.NotTracking" = "Není signál GPS!";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "V QR kódu nebylo nalezeno ID závodníka nebo značky.";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "Operaci nebylo možné na serveru dokončit. Zkuste to znovu.";

"CheckInRequestManagerError.GetBoatFailed" = "Nepodařilo se načíst loď.";

"CheckInRequestManagerError.GetCompetitorFailed" = "Nepodařilo se načíst závodníka.";

"CheckInRequestManagerError.GetEventFailed" = "Nepodařilo se načíst událost.";

"CheckInRequestManagerError.GetLeaderboardFailed" = "Nepodařilo se načíst výsledkovou tabuli.";

"CheckInRequestManagerError.GetMarkFailed" = "Nepodařilo se načíst značku.";

"CheckInRequestManagerError.GetTeamFailed" = "Nepodařilo se načíst tým.";

"CheckInRequestManagerError.PostCheckInFailed" = "Přihlášení se nezdařilo.";

"CheckInRequestManagerError.PostCheckOutFailed" = "Odhlášení se nezdařilo.";

"CheckInRequestManagerError.PostGPSFixFailed" = "Nepodařilo se odeslat polohy podle GPS.";

"CheckInRequestManagerError.PostTeamImageFailed" = "Nepodařilo se načíst obrázek týmu.";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "URL obrázku týmu je neplatné.";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "Regaty";

"StartView.TrainingButton.Title" = "Jeden trénink";

/* MARK: - AboutView */
"AboutView.Title" = "O této aplikaci";

"AboutView.PartnershipTextView.Text" = "Aplikace SAP Sail InSight využívá technologii mobilní telefonie ke sledování lodí při závodech a prostřednictvím aktuálních výsledků a 2D vizualizace umožňuje zájemcům sledovat závod v místě nebo online. I sami závodníci si mohou absolvovaný závod později přehrát, analyzovat výkon a využít poznatky ke správnému nastavení strategie. To vše na https://www.sapsailing.com\n\nSAP podporuje organizaci US Sailing zaváděním celé řady inovačních technologických řešení, která pomáhají při analýze a vylepšování výkonu týmů i individuálních závodníků, včetně aplikací využitelných přímo na vodě.\n\nUS Sailing jako národní orgán jachtingu řídí, zajišťuje a dohlíží na sportovní jachting v celé zemi a podporuje růst tohoto sportu mj. nabídkou školicích a vzdělávacích programů pro instruktory, závodní komisaře i rozhodčí.";

"AboutView.TermsButton.Title" = "Licenční smlouva s koncovým uživatelem";

"AboutView.VersionTitleLabel.Text" = "Verze";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "Kurz proti dnu";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "Regaty";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "Vaše regaty:";

"RegattaCheckInListView.FooterTextView.Text" = "Další informace na\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "QR kód naleznete v potvrzení účasti.";

"RegattaCheckInListView.TermsAlert.Title" = "Licenční smlouva s koncovým uživatelem";

"RegattaCheckInListView.TermsAlert.Message" = "Používáním této aplikace potvrzujete svůj souhlas s podmínkami licenční smlouvy s koncovým uživatelem SAP SE. Licenční smlouvu si přečtěte zde.";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "Licenční smlouva s koncovým uživatelem";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "Potvrdit";

"RegattaCheckInListView.NoCameraAlert.Message" = "Zařízení nemá fotoaparát.";

"RegattaCheckInListView.NoCodeAlert.Title" = "Nemáte QR kód?";

"RegattaCheckInListView.NoCodeAlert.Message" = "Pokud jste QR kód neobdrželi, obraťte se na vedení závodu.";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "Tréninky";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "Vaše tréninky:";

"TrainingCheckInListView.FooterTextView.Text" = "Abyste mohli spravovat tréninkové jednotky, vytvořte stisknutím tlačítka plus alespoň jeden trénink.";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "Analyzovat";

"TrainingView.OptionSheet.CheckOutAction.Title" = "Odebrat trénink";

"TrainingView.FinishButton.Title" = "Dokončit";

"TrainingView.ReactivateAlert.Title" = "Znovu aktivovat trénink";

"TrainingView.ReactivateAlert.Message" = "Tato tréninková jednotka skončila. Chcete ji opravdu znovu aktivovat?";

"TrainingView.ReactivatedAlert.Title" = "Tréninková jednotka je nyní aktivní.";

"TrainingView.FinishAlert.Title" = "Ukončit trénink";

"TrainingView.FinishAlert.Message" = "Chcete ukončit tuto tréninkovou jednotku?";

"TrainingView.FinishedAlert.Title" = "Tréninková jednotka byla úspěšně ukončena.";

"TrainingView.CheckOutAlert.Message" = "Chcete tuto tréninkovou jednotku skutečně odebrat ze svého zařízení?";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "Vytvořit trénink";

"CreateTrainingView.BoatClassNameLabel.Text" = "Lodní třída";

"CreateTrainingView.CreateTrainingButton.Title" = "Vytvořit trénink";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "Výsledková tabule";

/* MARK: - LicenseView */
"LicenseView.Title" = "Licenční informace";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "Dny";

"RegattaView.CountdownHoursTitleLabel.Text" = "Hodiny";

"RegattaView.CountdownMinutesTitleLabel.Text" = "Minuty";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "Regata začíná za:";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "Regata probíhá.";

"RegattaView.AnnouncementLabel.Text" = "Věnujte pozornost hlášení.";

"RegattaView.EventButton.Title" = "Událost";

"RegattaView.StartTrackingButton.Title" = "Zahájit sledování";

"RegattaView.OptionSheet.CheckOutAction.Title" = "Odhlášení";

"RegattaView.CheckOutAlert.Message" = "Opravdu se chcete odhlásit? Pro vstup do regaty se budete muset znovu přihlásit pomocí dodaného QR kódu.";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "Fotografie";

"CompetitorView.SelectImageAlert.Message" = "Chcete použít stávající obrázek, nebo pořídit nový?";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "Pořídit fotografii";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "Stávající";

"CompetitorView.TeamImageUploadRetryButton.Title" = "Chyba při uploadu.\nKlepnutím pokus zopakujte.";

"CompetitorView.TeamImageAddButton.Title" = "Přidat týmovou fotografii";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "Chyba při uploadu obrázku";

/* MARK: - ScanView */
"ScanView.Title" = "Skenovat QR kód";

"ScanView.IncorrectCodeAlert.Message" = "Neplatný QR kód";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "Rychlost proti dnu";

/* MARK: - SettingsView */
"SettingsView.Title" = "Nastavení";

"SettingsView.TableView.BatterySavingSection.Title" = "Úspora baterie";

"SettingsView.TableView.DeviceSection.Title" = "Informace o zařízení";

"SettingsView.TableView.TrainingSection.Title" = "Tréninkový prostor";

"SettingsView.BatterySavingTitleLabel.Text" = "Spořit energii";

"SettingsView.BatterySavingDescriptionLabel.Text" = "Aktualizace polohy GPS se odesílá na server každých %0.0f sekund.";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "Identifikátor zařízení";

"SettingsView.TrainingServerTitleLabel.Text" = "Koncový bod serveru";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "Doba sledování";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "Neodeslané polohy";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "Přesnost GPS";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "Chybí GPS";

"TrackingView.StopTrackingButton.Title" = "Zastavit sledování";

"TrackingView.StopTrackingAlert.Title" = "Potvrďte";

"TrackingView.StopTrackingAlert.Message" = "Chcete opravdu zastavit sledování?";

